Revit 2024 API
StairsLanding Class
 An object that represents a stairs landing in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class StairsLanding : Element
Visual Basic
Public Class StairsLanding _
	Inherits Element
Visual C++
public ref class StairsLanding : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.StairsLanding
See Also
StairsLanding Members
Autodesk.Revit.DB.Architecture Namespace